LuckkMaker/apm32-ceedling-example/svd/APM32F465.svd
<?xml version="1.0"?>
<device xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="1.1" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_1.xsd">
    <name>APM32F465</name>
    <version>1.0</version>
    <description>APM32F465</description>
    <!-- details about the cpu embedded in the device -->
    <cpu>
        <name>CM4</name>
        <revision>r1p0</revision>
        <endian>little</endian>
        <mpuPresent>false</mpuPresent>
        <fpuPresent>false</fpuPresent>
        <nvicPrioBits>3</nvicPrioBits>
        <vendorSystickConfig>false</vendorSystickConfig>
    </cpu>
    <!--Bus Interface Properties-->
    <!--Cortex-M4 is byte addressable-->
    <addressUnitBits>8</addressUnitBits>
    <!--the maximum data bit width accessible within a single transfer-->
    <width>32</width>
    <!--Register Default Properties-->
    <size>0x20</size>
    <resetValue>0x0</resetValue>
    <resetMask>0xFFFFFFFF</resetMask>
    <peripherals>
        <peripheral>
            <name>SMC</name>
            <description>Static memory controller</description>
            <groupName>SMC</groupName>
            <baseAddress>0xA0000000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>EMMC</name>
                <description>EMMC global interrupt</description>
                <value>48</value>
            </interrupt>
            <registers>
                <register>
                    <name>CSCTRL1</name>
                    <displayName>CSCTRL1</displayName>
                    <description>SRAM/NOR-Flash chip-select control register 1</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x000030D0</resetValue>
                    <fields>
                        <field>
                            <name>WRBURSTEN</name>
                            <description>Write PSRAM Burst Enable</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CRAMPSIZECFG</name>
                            <description>CRAM Page Size Configure</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>WSASYNCEN</name>
                            <description>Wait Signal During Asynchronous Transfers Enable</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EXTMODEEN</name>
                            <description>Extended Mode Enable</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WAITEN</name>
                            <description>Wait Enable</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WREN</name>
                            <description>Write Memory Enable</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WTIMCFG</name>
                            <description>Wait Timing Configure</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WRAPBEN</name>
                            <description>Wrapped Burst Mode Enable</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WSPOLCFG</name>
                            <description>Wait Signal Polarity Configure</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BURSTEN</name>
                            <description>Burst Mode Enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NORFMACCEN</name>
                            <description>NORFlash Memory Access Enable</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MDBWIDCFG</name>
                            <description>Memory Data Bus Width Configure</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MTYPECFG</name>
                            <description>Memory Type Configure</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>ADMUXEN</name>
                            <description>Address/Data Multiplexing Enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MBKEN</name>
                            <description>Enable the Corresponding Memory Bank</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CSTIM1</name>
                    <displayName>CSTIM1</displayName>
                    <description>SRAM/NOR-Flash chip-select timing register 1</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <fields>
                        <field>
                            <name>ASYNCACCCFG</name>
                            <description>Asynchronous Access Mode Configure</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DATALATCFG</name>
                            <description>Data Latency Configure</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>CLKDIVCFG</name>
                            <description>Clock Divide Factor Configure</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>BUSTURNCFG</name>
                            <description>Bus Turnaround Phase Duration Configure</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DATASETCFG</name>
                            <description>Data Setup Time Configure</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>ADDRHLDCFG</name>
                            <description>Address-Hold Time Configure</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>ADDRSETCFG</name>
                            <description>Address Setup Time Configure</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CSCTRL2</name>
                    <displayName>CSCTRL2</displayName>
                    <description>SRAM/NOR-Flash chip-select control register 2</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x000030D0</resetValue>
                    <fields>
                        <field>
                            <name>WRBURSTEN</name>
                            <description>Write PSRAM Burst Enable</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CRAMPSIZECFG</name>
                            <description>CRAM Page Size Configure</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>WSASYNCEN</name>
                            <description>Wait Signal During Asynchronous Transfers Enable</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EXTMODEEN</name>
                            <description>Extended Mode Enable</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WAITEN</name>
                            <description>Wait Enable</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WREN</name>
                            <description>Write Memory Enable</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WTIMCFG</name>
                            <description>Wait Timing Configure</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WRAPBEN</name>
                            <description>Wrapped Burst Mode Enable</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WSPOLCFG</name>
                            <description>Wait Signal Polarity Configure</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BURSTEN</name>
                            <description>Burst Mode Enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NORFMACCEN</name>
                            <description>NORFlash Memory Access Enable</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MDBWIDCFG</name>
                            <description>Memory Data Bus Width Configure</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MTYPECFG</name>
                            <description>Memory Type Configure</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>ADMUXEN</name>
                            <description>Address/Data Multiplexing Enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MBKEN</name>
                            <description>Enable the Corresponding Memory Bank</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CSTIM2</name>
                    <displayName>CSTIM2</displayName>
                    <description>SRAM/NOR-Flash chip-select timing register 2</description>
                    <addressOffset>0xC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <fields>
                        <field>
                            <name>ASYNCACCCFG</name>
                            <description>Asynchronous Access Mode Configure</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DATALATCFG</name>
                            <description>Data Latency Configure</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>CLKDIVCFG</name>
                            <description>Clock Divide Factor Configure</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>BUSTURNCFG</name>
                            <description>Bus Turnaround Phase Duration Configure</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DATASETCFG</name>
                            <description>Data Setup Time Configure</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>ADDRHLDCFG</name>
                            <description>Address-Hold Time Configure</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>ADDRSETCFG</name>
                            <description>Address Setup Time Configure</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CSCTRL3</name>
                    <displayName>CSCTRL3</displayName>
                    <description>SRAM/NOR-Flash chip-select control register 3</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x000030D0</resetValue>
                    <fields>
                        <field>
                            <name>WRBURSTEN</name>
                            <description>Write PSRAM Burst Enable</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CRAMPSIZECFG</name>
                            <description>CRAM Page Size Configure</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>WSASYNCEN</name>
                            <description>Wait Signal During Asynchronous Transfers Enable</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EXTMODEEN</name>
                            <description>Extended Mode Enable</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WAITEN</name>
                            <description>Wait Enable</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WREN</name>
                            <description>Write Memory Enable</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WTIMCFG</name>
                            <description>Wait Timing Configure</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WRAPBEN</name>
                            <description>Wrapped Burst Mode Enable</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WSPOLCFG</name>
                            <description>Wait Signal Polarity Configure</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BURSTEN</name>
                            <description>Burst Mode Enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NORFMACCEN</name>
                            <description>NORFlash Memory Access Enable</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MDBWIDCFG</name>
                            <description>Memory Data Bus Width Configure</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MTYPECFG</name>
                            <description>Memory Type Configure</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>ADMUXEN</name>
                            <description>Address/Data Multiplexing Enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MBKEN</name>
                            <description>Enable the Corresponding Memory Bank</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
