LuckkMaker/apm32-ceedling-example/svd/APM32F465.svd
                <register>
                    <name>LPAPB2CLKEN</name>
                    <displayName>LPAPB2CLKEN</displayName>
                    <description>APB2 peripheral clock enabled in low power
          mode register</description>
                    <addressOffset>0x64</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00075F33</resetValue>
                    <fields>
                        <field>
                            <name>TMR11EN</name>
                            <description>TMR11 clock enable during Sleep
              mode</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TMR10EN</name>
                            <description>TMR10 clock enable during Sleep
              mode</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TMR9EN</name>
                            <description>TMR9 clock enable during sleep
              mode</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SYSCFGEN</name>
                            <description>System configuration controller clock
              enable during Sleep mode</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI1EN</name>
                            <description>SPI 1 clock enable during Sleep
              mode</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SDIOEN</name>
                            <description>SDIO clock enable during Sleep
              mode</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ADC3EN</name>
                            <description>ADC 3 clock enable during Sleep
              mode</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ADC2EN</name>
                            <description>ADC2 clock enable during Sleep
              mode</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ADC1EN</name>
                            <description>ADC1 clock enable during Sleep
              mode</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>USART6EN</name>
                            <description>USART6 clock enable during Sleep
              mode</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>USART1EN</name>
                            <description>USART1 clock enable during Sleep
              mode</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TMR8EN</name>
                            <description>TMR8 clock enable during Sleep
              mode</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TMR1EN</name>
                            <description>TMR1 clock enable during Sleep
              mode</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BDCTRL</name>
                    <displayName>BDCTRL</displayName>
                    <description>Backup domain control register</description>
                    <addressOffset>0x70</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BDRST</name>
                            <description>Backup domain software
              reset</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RTCCLKEN</name>
                            <description>RTC clock enable</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RTCSRCSEL</name>
                            <description>RTC clock source selection</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LSEBCFG</name>
                            <description>External low-speed oscillator
              bypass</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LSERDYFLG</name>
                            <description>External low-speed oscillator
              ready</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LSEEN</name>
                            <description>External low-speed oscillator
              enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CSTS</name>
                    <displayName>CSTS</displayName>
                    <description>clock control &amp; status
          register</description>
                    <addressOffset>0x74</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x0E000000</resetValue>
                    <fields>
                        <field>
                            <name>LPWRRSTFLG</name>
                            <description>Low-power reset flag</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WWDTRSTFLG</name>
                            <description>Window watchdog reset flag</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IWDTRSTFLG</name>
                            <description>Independent watchdog reset
              flag</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SWRSTFLG</name>
                            <description>Software reset flag</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PODRSTFLG</name>
                            <description>POR/PDR reset flag</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PINRSTFLG</name>
                            <description>PIN reset flag</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BORRSTFLG</name>
                            <description>BOR reset flag</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSTFLGCLR</name>
                            <description>Remove reset flag</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LSIRDYFLG</name>
                            <description>Internal low-speed oscillator
              ready</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LSIEN</name>
                            <description>Internal low-speed oscillator
              enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SSCCFG</name>
                    <displayName>SSCCFG</displayName>
                    <description>spread spectrum clock generation
          register</description>
                    <addressOffset>0x80</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SSEN</name>
                            <description>Spread spectrum modulation
              enable</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SSSEL</name>
                            <description>Spread Select</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STEP</name>
                            <description>Incrementation step</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>15</bitWidth>
                        </field>
                        <field>
                            <name>MODPCFG</name>
                            <description>Modulation period</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>13</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLL2CFG</name>
                    <displayName>PLL2CFG</displayName>
                    <description>PLLI2S configuration register</description>
                    <addressOffset>0x84</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x20003000</resetValue>
                    <fields>
                        <field>
                            <name>PLL2C</name>
                            <description>PLLI2S division factor for I2S
              clocks</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>PLL2A</name>
                            <description>PLLI2S multiplication factor for
              VCO</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>9</bitWidth>
                        </field>
                    </fields>
                </register>
