LuckkMaker/apm32-ceedling-example/svd/APM32F465.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>OTG_FS_PWRCLK</name>
            <description>USB on the go full speed</description>
            <groupName>USB_OTG_FS</groupName>
            <baseAddress>0x50000E00</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>FS_PCGCCTL</name>
                    <displayName>FS_PCGCCTL</displayName>
                    <description>OTG_FS power and clock gating control
          register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PCLKSTOP</name>
                            <description>Stop PHY clock</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GCLK</name>
                            <description>Gate HCLK</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PHYSUS</name>
                            <description>PHY Suspended</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>OTG_HS1_GLOBAL</name>
            <description>USB on the go high speed</description>
            <groupName>USB_OTG_HS</groupName>
            <baseAddress>0x40040000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x131</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>OTG_HS1_EP1_OUT</name>
                <description>USB On The Go HS1 End Point 1 Out global
        interrupt</description>
                <value>74</value>
            </interrupt>
            <interrupt>
                <name>OTG_HS1_EP1_IN</name>
                <description>USB On The Go HS1 End Point 1 In global
        interrupt</description>
                <value>75</value>
            </interrupt>
            <interrupt>
                <name>OTG_HS1_WKUP</name>
                <description>USB On The Go HS1 Wakeup through EINT
        interrupt</description>
                <value>76</value>
            </interrupt>
            <interrupt>
                <name>OTG_HS1</name>
                <description>USB On The Go HS1 global
        interrupt</description>
                <value>77</value>
            </interrupt>
            <registers>
                <register>
                    <name>GCTRLSTS</name>
                    <displayName>GCTRLSTS</displayName>
                    <description>OTG_HS control and status
          register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <resetValue>0x00000800</resetValue>
                    <fields>
                        <field>
                            <name>SREQSUC</name>
                            <description>Session request success</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SREQ</name>
                            <description>Session request</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HNSUC</name>
                            <description>Host negotiation success</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HNPREQ</name>
                            <description>HNP request</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HHNPEN</name>
                            <description>Host set HNP enable</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DHNPEN</name>
                            <description>Device HNP enabled</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CIDSTS</name>
                            <description>Connector ID status</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LSDEBT</name>
                            <description>Long/short debounce time</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ASVD</name>
                            <description>A-session valid</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BSVD</name>
                            <description>B-session valid</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GINT</name>
                    <displayName>GINT</displayName>
                    <description>OTG_HS interrupt register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>SEFLG</name>
                            <description>Session end detected</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SREQSFLG</name>
                            <description>Session request success status
              change</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HNSFLG</name>
                            <description>Host negotiation success status
              change</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HNFLG</name>
                            <description>Host negotiation detected</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ADTOFLG</name>
                            <description>A-device timeout change</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DEBDFLG</name>
                            <description>Debounce done</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GAHBCFG</name>
                    <displayName>GAHBCFG</displayName>
                    <description>OTG_HS AHB configuration
          register</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>GINTMASK</name>
                            <description>Global interrupt mask</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BLT</name>
                            <description>Burst length/type</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DMAEN</name>
                            <description>DMA enable</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXFEL</name>
                            <description>TxFIFO empty level</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PTXFEL</name>
                            <description>Periodic TxFIFO empty
              level</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GUSBCFG</name>
                    <displayName>GUSBCFG</displayName>
                    <description>OTG_HS USB configuration
          register</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <resetValue>0x00000A00</resetValue>
                    <fields>
                        <field>
                            <name>SEFLG</name>
                            <description>FS timeout calibration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FSSTSEL</name>
                            <description>USB 2.0 high-speed ULPI PHY or USB 1.1
              full-speed serial transceiver select</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SRPEN</name>
                            <description>SRP-capable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HNPEN</name>
                            <description>HNP-capable</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TRTIM</name>
                            <description>USB turnaround time</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PHYLPSEL</name>
                            <description>PHY Low-power clock select</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ULPISEL</name>
                            <description>ULPI FS/LS select</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ULPIAR</name>
                            <description>ULPI Auto-resume</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ULPICLKP</name>
                            <description>ULPI Clock SuspendM</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ULPIEVDSEL</name>
                            <description>ULPI External VBUS Drive</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ULPIEVC</name>
                            <description>ULPI external VBUS
              indicator</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DPSEL</name>
                            <description>TermSel DLine pulsing
              selection</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SINI</name>
                            <description>Signal Invert</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NPTHQ</name>
                            <description>No Pass Through Qualified</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ULPIIPCDIS</name>
                            <description>ULPI interface protect
              disable</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FHMODE</name>
                            <description>Forced host mode</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FDMODE</name>
                            <description>Forced peripheral mode</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CTXP</name>
                            <description>Corrupt Tx packet</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GRSTCTRL</name>
                    <displayName>GRSTCTRL</displayName>
                    <description>OTG_HS reset register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <resetValue>0x20000000</resetValue>
                    <fields>
                        <field>
                            <name>CSRST</name>
                            <description>Core soft reset</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSRST</name>
                            <description>HCLK soft reset</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HFCNTRST</name>
                            <description>Host frame counter reset</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RXFFLU</name>
                            <description>RxFIFO flush</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXFFLU</name>
                            <description>TxFIFO flush</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXFNUM</name>
                            <description>TxFIFO number</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DMAREQ</name>
                            <description>DMA request signal</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>AHBMIDL</name>
                            <description>AHB master idle</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
