LuckkMaker/apm32-ceedling-example/svd/APM32F465.svd
                <register>
                    <name>GRXSTSP</name>
                    <displayName>GRXSTSP</displayName>
                    <description>OTG_HS status read and pop register (host
          mode)</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>CHNUM</name>
                            <description>Channel number</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>BCNT</name>
                            <description>Byte count</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>DPIDSEL</name>
                            <description>Data PID</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PSTSSEL</name>
                            <description>Packet status</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OTG_HS_GRXSTSP_Peripheral</name>
                    <displayName>OTG_HS_GRXSTSP_Peripheral</displayName>
                    <description>OTG_HS status read and pop register
          (peripheral mode)</description>
                    <alternateRegister>GRXSTSP</alternateRegister>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>EPNUM</name>
                            <description>Endpoint number</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>BCNT</name>
                            <description>Byte count</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>DPIDSEL</name>
                            <description>Data PID</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PSTSSEL</name>
                            <description>Packet status</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>FNUM</name>
                            <description>Frame number</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GRXFIFO</name>
                    <displayName>GRXFIFO</displayName>
                    <description>OTG_HS Receive FIFO size
          register</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000200</resetValue>
                    <fields>
                        <field>
                            <name>RXFDEP</name>
                            <description>RxFIFO depth</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GNPTXF_GEDOTXF</name>
                    <displayName>OTG_HS_GNPTXFSIZ_Host</displayName>
                    <description>OTG_HS nonperiodic transmit FIFO size
          register (host mode)</description>
                    <addressOffset>0x28</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000200</resetValue>
                    <fields>
                        <field>
                            <name>NPTXSA</name>
                            <description>Nonperiodic transmit RAM start
              address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>NPTXFDEP</name>
                            <description>Nonperiodic TxFIFO depth</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OTG_HS_TX0FSIZ_Peripheral</name>
                    <displayName>OTG_HS_TX0FSIZ_Peripheral</displayName>
                    <description>Endpoint 0 transmit FIFO size (peripheral
          mode)</description>
                    <alternateRegister>GNPTXF_GEDOTXF</alternateRegister>
                    <addressOffset>0x28</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000200</resetValue>
                    <fields>
                        <field>
                            <name>EPTXSA</name>
                            <description>Endpoint 0 transmit RAM start
              address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>EPTXFDEP</name>
                            <description>Endpoint 0 TxFIFO depth</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GNPTXFQSTS</name>
                    <displayName>GNPTXFQSTS</displayName>
                    <description>OTG_HS nonperiodic transmit FIFO/queue
          status register</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00080200</resetValue>
                    <fields>
                        <field>
                            <name>NPTXFSASEL</name>
                            <description>Nonperiodic TxFIFO space
              available</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>NPTXRSASEL</name>
                            <description>Nonperiodic transmit request queue space
              available</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>NPTXRQ</name>
                            <description>Top of the nonperiodic transmit request
              queue</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GGCCFG</name>
                    <displayName>GGCCFG</displayName>
                    <description>OTG_HS general core configuration
          register</description>
                    <addressOffset>0x38</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>PWEN</name>
                            <description>Power down</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2CBEN</name>
                            <description>Enable I2C bus connection for the
              external I2C PHY interface</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ADVBSEN</name>
                            <description>Enable the VBUS sensing
              device</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BDVBSEN</name>
                            <description>Enable the VBUS sensing device</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SOFPOUT</name>
                            <description>SOF output enable</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VBSDIS</name>
                            <description>VBUS sensing disable
              option</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GCID</name>
                    <displayName>GCID</displayName>
                    <description>OTG_HS core ID register</description>
                    <addressOffset>0x3C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00001200</resetValue>
                    <fields>
                        <field>
                            <name>PID</name>
                            <description>Product ID field</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GHPTXFIFO</name>
                    <displayName>GHPTXFIFO</displayName>
                    <description>OTG_HS Host periodic transmit FIFO size
          register</description>
                    <addressOffset>0x100</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x02000600</resetValue>
                    <fields>
                        <field>
                            <name>HPDTXFSA</name>
                            <description>Host periodic TxFIFO start
              address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>HPDTXFDEP</name>
                            <description>Host periodic TxFIFO depth</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DTXFIFO1</name>
                    <displayName>DTXFIFO1</displayName>
                    <description>OTG_HS device IN endpoint transmit FIFO size
          register</description>
                    <addressOffset>0x104</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x02000400</resetValue>
                    <fields>
                        <field>
                            <name>INEPTXFRSA</name>
                            <description>IN endpoint FIFOx transmit RAM start
              address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>INEPTXFDEP</name>
                            <description>IN endpoint TxFIFO depth</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DTXFIFO2</name>
                    <displayName>DTXFIFO2</displayName>
                    <description>OTG_HS device IN endpoint transmit FIFO size
          register</description>
                    <addressOffset>0x108</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x02000400</resetValue>
                    <fields>
                        <field>
                            <name>INEPTXFRSA</name>
                            <description>IN endpoint FIFOx transmit RAM start
              address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>INEPTXFDEP</name>
                            <description>IN endpoint TxFIFO depth</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DTXFIFO3</name>
                    <displayName>DTXFIFO3</displayName>
                    <description>OTG_HS device IN endpoint transmit FIFO size
          register</description>
                    <addressOffset>0x11C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x02000400</resetValue>
                    <fields>
                        <field>
                            <name>INEPTXFRSA</name>
                            <description>IN endpoint FIFOx transmit RAM start
              address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>INEPTXFDEP</name>
                            <description>IN endpoint TxFIFO depth</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DTXFIFO4</name>
                    <displayName>DTXFIFO4</displayName>
                    <description>OTG_HS device IN endpoint transmit FIFO size
          register</description>
                    <addressOffset>0x120</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x02000400</resetValue>
                    <fields>
                        <field>
                            <name>INEPTXFRSA</name>
                            <description>IN endpoint FIFOx transmit RAM start
              address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>INEPTXFDEP</name>
                            <description>IN endpoint TxFIFO depth</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DTXFIFO5</name>
                    <displayName>DTXFIFO5</displayName>
                    <description>OTG_HS device IN endpoint transmit FIFO size
          register</description>
                    <addressOffset>0x124</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x02000400</resetValue>
                    <fields>
                        <field>
                            <name>INEPTXFRSA</name>
                            <description>IN endpoint FIFOx transmit RAM start
              address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>INEPTXFDEP</name>
                            <description>IN endpoint TxFIFO depth</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DTXFIFO16</name>
                    <displayName>DTXFIFO6</displayName>
                    <description>OTG_HS device IN endpoint transmit FIFO size
          register</description>
                    <addressOffset>0x128</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x02000400</resetValue>
                    <fields>
                        <field>
                            <name>INEPTXFRSA</name>
                            <description>IN endpoint FIFOx transmit RAM start
              address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>INEPTXFDEP</name>
                            <description>IN endpoint TxFIFO depth</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DTXFIFO7</name>
                    <displayName>DTXFIFO7</displayName>
                    <description>OTG_HS device IN endpoint transmit FIFO size
          register</description>
                    <addressOffset>0x12C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x02000400</resetValue>
                    <fields>
                        <field>
                            <name>INEPTXFRSA</name>
                            <description>IN endpoint FIFOx transmit RAM start
              address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>INEPTXFDEP</name>
                            <description>IN endpoint TxFIFO depth</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
