LuckkMaker/apm32-ceedling-example/svd/APM32F465.svd
                <register>
                    <name>HCHIMASK10</name>
                    <displayName>HCHIMASK10</displayName>
                    <description>OTG_HS host channel-10 interrupt mask
          register</description>
                    <addressOffset>0x24C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>TSFCMPNM</name>
                            <description>Transfer completed mask</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSFCMPANM</name>
                            <description>Channel halted mask</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>AHBERRM</name>
                            <description>AHB error</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXSTALLM</name>
                            <description>STALL response received interrupt
              mask</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXNAKM</name>
                            <description>NAK response received interrupt
              mask</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXTXACKM</name>
                            <description>ACK response received/transmitted
              interrupt mask</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXNYETM</name>
                            <description>response received interrupt
              mask</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TERRM</name>
                            <description>Transaction error mask</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BABBLEM</name>
                            <description>Babble error mask</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FOVRM</name>
                            <description>Frame overrun mask</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DTOGM</name>
                            <description>Data toggle error mask</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCHIMASK11</name>
                    <displayName>HCHIMASK11</displayName>
                    <description>OTG_HS host channel-11 interrupt mask
          register</description>
                    <addressOffset>0x26C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>TSFCMPNM</name>
                            <description>Transfer completed mask</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSFCMPANM</name>
                            <description>Channel halted mask</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>AHBERRM</name>
                            <description>AHB error</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXSTALLM</name>
                            <description>STALL response received interrupt
              mask</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXNAKM</name>
                            <description>NAK response received interrupt
              mask</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXTXACKM</name>
                            <description>ACK response received/transmitted
              interrupt mask</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXNYETM</name>
                            <description>response received interrupt
              mask</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TERRM</name>
                            <description>Transaction error mask</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BABBLEM</name>
                            <description>Babble error mask</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FOVRM</name>
                            <description>Frame overrun mask</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DTOGM</name>
                            <description>Data toggle error mask</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCHTSIZE0</name>
                    <displayName>HCHTSIZE0</displayName>
                    <description>OTG_HS host channel-11 transfer size
          register</description>
                    <addressOffset>0x110</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>TSFSIZE</name>
                            <description>Transfer size</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>19</bitWidth>
                        </field>
                        <field>
                            <name>PCKTCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>DATAPID</name>
                            <description>Data PID</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCHTSIZE1</name>
                    <displayName>HCHTSIZE1</displayName>
                    <description>OTG_HS host channel-1 transfer size
          register</description>
                    <addressOffset>0x130</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>TSFSIZE</name>
                            <description>Transfer size</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>19</bitWidth>
                        </field>
                        <field>
                            <name>PCKTCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>DATAPID</name>
                            <description>Data PID</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCHTSIZE2</name>
                    <displayName>HCHTSIZE2</displayName>
                    <description>OTG_HS host channel-2 transfer size
          register</description>
                    <addressOffset>0x150</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>TSFSIZE</name>
                            <description>Transfer size</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>19</bitWidth>
                        </field>
                        <field>
                            <name>PCKTCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>DATAPID</name>
                            <description>Data PID</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCHTSIZE3</name>
                    <displayName>HCHTSIZE3</displayName>
                    <description>OTG_HS host channel-3 transfer size
          register</description>
                    <addressOffset>0x170</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>TSFSIZE</name>
                            <description>Transfer size</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>19</bitWidth>
                        </field>
                        <field>
                            <name>PCKTCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>DATAPID</name>
                            <description>Data PID</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCHTSIZE4</name>
                    <displayName>HCHTSIZE4</displayName>
                    <description>OTG_HS host channel-4 transfer size
          register</description>
                    <addressOffset>0x190</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>TSFSIZE</name>
                            <description>Transfer size</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>19</bitWidth>
                        </field>
                        <field>
                            <name>PCKTCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>DATAPID</name>
                            <description>Data PID</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCHTSIZE5</name>
                    <displayName>HCHTSIZE5</displayName>
                    <description>OTG_HS host channel-5 transfer size
          register</description>
                    <addressOffset>0x1B0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>TSFSIZE</name>
                            <description>Transfer size</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>19</bitWidth>
                        </field>
                        <field>
                            <name>PCKTCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>DATAPID</name>
                            <description>Data PID</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCHTSIZE6</name>
                    <displayName>HCHTSIZE6</displayName>
                    <description>OTG_HS host channel-6 transfer size
          register</description>
                    <addressOffset>0x1D0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>TSFSIZE</name>
                            <description>Transfer size</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>19</bitWidth>
                        </field>
                        <field>
                            <name>PCKTCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>DATAPID</name>
                            <description>Data PID</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCHTSIZE7</name>
                    <displayName>HCHTSIZE7</displayName>
                    <description>OTG_HS host channel-7 transfer size
          register</description>
                    <addressOffset>0x1F0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>TSFSIZE</name>
                            <description>Transfer size</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>19</bitWidth>
                        </field>
                        <field>
                            <name>PCKTCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>DATAPID</name>
                            <description>Data PID</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCHTSIZE8</name>
                    <displayName>HCHTSIZE8</displayName>
                    <description>OTG_HS host channel-8 transfer size
          register</description>
                    <addressOffset>0x210</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>TSFSIZE</name>
                            <description>Transfer size</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>19</bitWidth>
                        </field>
                        <field>
                            <name>PCKTCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>DATAPID</name>
                            <description>Data PID</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCHTSIZE9</name>
                    <displayName>HCHTSIZE9</displayName>
                    <description>OTG_HS host channel-9 transfer size
          register</description>
                    <addressOffset>0x230</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>TSFSIZE</name>
                            <description>Transfer size</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>19</bitWidth>
                        </field>
                        <field>
                            <name>PCKTCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>DATAPID</name>
                            <description>Data PID</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCHTSIZE10</name>
                    <displayName>HCHTSIZE10</displayName>
                    <description>OTG_HS host channel-10 transfer size
          register</description>
                    <addressOffset>0x250</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>TSFSIZE</name>
                            <description>Transfer size</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>19</bitWidth>
                        </field>
                        <field>
                            <name>PCKTCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>DATAPID</name>
                            <description>Data PID</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
