LuckkMaker/apm32-ceedling-example/svd/APM32F465.svd
                <register>
                    <name>HCHTSIZE11</name>
                    <displayName>HCHTSIZE11</displayName>
                    <description>OTG_HS host channel-11 transfer size
          register</description>
                    <addressOffset>0x270</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>TSFSIZE</name>
                            <description>Transfer size</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>19</bitWidth>
                        </field>
                        <field>
                            <name>PCKTCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>DATAPID</name>
                            <description>Data PID</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCHDMA0</name>
                    <displayName>HCHDMA0</displayName>
                    <description>OTG_HS host channel-0 DMA address
          register</description>
                    <addressOffset>0x114</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>DMA address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCHDMA1</name>
                    <displayName>HCHDMA1</displayName>
                    <description>OTG_HS host channel-1 DMA address
          register</description>
                    <addressOffset>0x134</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>DMA address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCHDMA2</name>
                    <displayName>HCHDMA2</displayName>
                    <description>OTG_HS host channel-2 DMA address
          register</description>
                    <addressOffset>0x154</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>DMA address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCHDMA3</name>
                    <displayName>HCHDMA3</displayName>
                    <description>OTG_HS host channel-3 DMA address
          register</description>
                    <addressOffset>0x174</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>DMA address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCHDMA4</name>
                    <displayName>HCHDMA4</displayName>
                    <description>OTG_HS host channel-4 DMA address
          register</description>
                    <addressOffset>0x194</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>DMA address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCHDMA5</name>
                    <displayName>HCHDMA5</displayName>
                    <description>OTG_HS host channel-5 DMA address
          register</description>
                    <addressOffset>0x1B4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>DMA address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCHDMA6</name>
                    <displayName>HCHDMA6</displayName>
                    <description>OTG_HS host channel-6 DMA address
          register</description>
                    <addressOffset>0x1D4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>DMA address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCHDMA7</name>
                    <displayName>HCHDMA7</displayName>
                    <description>OTG_HS host channel-7 DMA address
          register</description>
                    <addressOffset>0x1F4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>DMA address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCHDMA8</name>
                    <displayName>HCHDMA8</displayName>
                    <description>OTG_HS host channel-8 DMA address
          register</description>
                    <addressOffset>0x214</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>DMA address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCHDMA9</name>
                    <displayName>HCHDMA9</displayName>
                    <description>OTG_HS host channel-9 DMA address
          register</description>
                    <addressOffset>0x234</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>DMA address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCHDMA10</name>
                    <displayName>HCHDMA10</displayName>
                    <description>OTG_HS host channel-10 DMA address
          register</description>
                    <addressOffset>0x254</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>DMA address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCHDMA11</name>
                    <displayName>HCHDMA11</displayName>
                    <description>OTG_HS host channel-11 DMA address
          register</description>
                    <addressOffset>0x274</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>DMA address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
